In [7]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

2.2.0
1.26.3

In [2]:
data = {'nim': ['10', '11', '12', '13', '  '],
        'nama': ['aldi', '  ', 'jojobiz', '  ', 'sukuna']}

df = pd.DataFrame(data)
df

  nim     nama
0  10     aldi
1  11
2  12  jojobiz
3  13
4       sukuna

In [3]:
df

  nim     nama
0  10     aldi
1  11
2  12  jojobiz
3  13
4       sukuna

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nim     5 non-null      object
 1   nama    5 non-null      object
dtypes: object(2)
memory usage: 208.0+ bytes

In [5]:
df = df.replace(r'^\s*$', np.nan, regex=True)
df

   nim     nama
0   10     aldi
1   11      NaN
2   12  jojobiz
3   13      NaN
4  NaN   sukuna

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nim     4 non-null      object
 1   nama    3 non-null      object
dtypes: object(2)
memory usage: 208.0+ bytes